In [1]:
import pandas as pd
import numpy as np

In [10]:
data1.head()

,job_title,job_detail_url,job_listed,company_name,company_link,company_location
0,Data Analyst H/F,https://fr.linkedin.com/jobs/view/data-analyst...,1 day ago,Groupe TF1,https://fr.linkedin.com/company/groupetf1?trk=...,Greater Paris Metropolitan Region
1,Data Scientist,https://fr.linkedin.com/jobs/view/data-scienti...,8 hours ago,Université de Reims Champagne-Ardenne,https://fr.linkedin.com/company/universite-de-...,"Reims, Grand Est, France"
2,Junior Financial Business Analyst,https://fr.linkedin.com/jobs/view/junior-finan...,1 week ago,Accor,https://fr.linkedin.com/company/accor?trk=publ...,"Issy-les-Moulineaux, Île-de-France, France"
3,Media Data intern,https://fr.linkedin.com/jobs/view/media-data-i...,1 week ago,Loewe,https://es.linkedin.com/company/loewe?trk=publ...,"Paris, Île-de-France, France"
4,Data Scientist Assistant,https://fr.linkedin.com/jobs/view/data-scienti...,3 weeks ago,Teads,https://www.linkedin.com/company/teads?trk=pub...,"Montpellier, Occitanie, France"

In [30]:
# Drop rows where any column contains 'not-found'
cleaned_data = data[~data.apply(lambda row: row.astype(str).str.contains('not-found').any(), axis=1)]

In [31]:
# Save the cleaned data to a new CSV file
cleaned_data.to_csv('cleaned_jobs.csv', index=False)

### Import Data

In [6]:
data_1 = pd.read_csv('scrapped jobs.csv')
# Add the new column 'date' and fill it with 2024
data_1['datePublication'] = 2024
data_1.head()

,job_title,job_detail_url,job_listed,company_name,company_link,company_location,datePublication
0,Data Analyst H/F,https://fr.linkedin.com/jobs/view/data-analyst...,1 day ago,Groupe TF1,https://fr.linkedin.com/company/groupetf1?trk=...,Greater Paris Metropolitan Region,2024
1,Data Scientist,https://fr.linkedin.com/jobs/view/data-scienti...,8 hours ago,Université de Reims Champagne-Ardenne,https://fr.linkedin.com/company/universite-de-...,"Reims, Grand Est, France",2024
2,Junior Financial Business Analyst,https://fr.linkedin.com/jobs/view/junior-finan...,1 week ago,Accor,https://fr.linkedin.com/company/accor?trk=publ...,"Issy-les-Moulineaux, Île-de-France, France",2024
3,Media Data intern,https://fr.linkedin.com/jobs/view/media-data-i...,1 week ago,Loewe,https://es.linkedin.com/company/loewe?trk=publ...,"Paris, Île-de-France, France",2024
4,Data Scientist Assistant,https://fr.linkedin.com/jobs/view/data-scienti...,3 weeks ago,Teads,https://www.linkedin.com/company/teads?trk=pub...,"Montpellier, Occitanie, France",2024

In [7]:
# Drop the columns 'job_detail_url' and 'job_listed'
data_1 = data_1.drop(columns=['job_detail_url', 'job_listed','company_name','company_link'])
data_1.head()

,job_title,company_location,datePublication
0,Data Analyst H/F,Greater Paris Metropolitan Region,2024
1,Data Scientist,"Reims, Grand Est, France",2024
2,Junior Financial Business Analyst,"Issy-les-Moulineaux, Île-de-France, France",2024
3,Media Data intern,"Paris, Île-de-France, France",2024
4,Data Scientist Assistant,"Montpellier, Occitanie, France",2024

In [5]:
data_1.shape

(1189, 5)

In [5]:
# Load the CSV data
data_2 = pd.read_csv(r"C:\Users\User\Desktop\Project\2-Cleaning_Data\data\French jobs dataset.csv")
data_2.head()

,Unnamed: 0,adresseOffre,intitule,datePublication,datePremierePublication,LANGUE,SAVOIR_ETRE,SAVOIR_FAIRE,salaireTexte,entreprise,enseigne,description,profil,entreprise_description
0,0,NEUILLY SUR SEINE,Développeur Python F/H,2023-11-23T06:09:41.000+0000,2023-11-23T06:09:41.000+0000,['Anglais'],"['Autonomie', 'Capacité de communication', 'Ri...","['Linux', 'Python', 'Web', 'Administration sys...",40 - 50 k€ brut annuel,MICHAEL PAGE INTERNATIONAL FRANCE,MICHAEL PAGE INTERNATIONAL FRANCE,"Comme Développeur Python, vos missions princip...","En tant que Développeur Python, vous justifiez...",Entreprise française présente dans plus de 80 ...
1,1,PARIS 18,Développeur Python F/H,2023-11-23T08:27:41.000+0000,2023-11-08T13:44:36.000+0000,NaN,NaN,"['Analyse des besoins', 'Django', 'Framework d...",A négocier,KAPA IT,KAPA IT,Sous la responsabilité d'un chef de projet et ...,Formation Bac+5 type école d'ingénieurs ou équ...,"Kapa IT, ESN présente sur le territoire nation..."
2,2,PARIS 18,Développeur Python F/H,2023-11-23T08:27:25.000+0000,2023-11-08T13:25:02.000+0000,NaN,NaN,"['Analyse des besoins', 'Cycle en V', 'Django'...",A négocier,KAPA IT,KAPA IT,Sous la responsabilité d'un chef de projet et ...,Formation Bac+5 type école d'ingénieurs ou équ...,"Kapa IT, ESN présente sur le territoire nation..."
3,3,GRENOBLE,Développeur Python F/H,2023-11-22T14:06:53.000+0000,2023-11-13T15:52:08.000+0000,"['Français', 'Anglais']","[""Esprit d'équipe"", 'Force de proposition']","['Python', 'ReactJS', 'Application Web', 'Base...",A partir de 50 k€ brut annuel,D3S,D3S,L'équipe D3S propose des solutions logicielles...,Ingénieur passionné par le développementVous ê...,"Depuis 2016, D3S développe des algorithmes et ..."
4,4,AIX EN PROVENCE,Developpeur Python F/H,2023-11-22T16:24:46.000+0000,2023-10-17T07:32:04.000+0000,['Anglais'],"[""Esprit d'équipe"", 'Curiosité', 'Passionne', ...","['Qualité', 'Communication', 'Communication éc...",43 - 45 k€ brut annuel,WORKSOFT,WORKSOFT,Notre client niçois développe des solutions IT...,Compétences : 1 an Min d expérience en Python...,WORKSOFT est un cabinet de recrutement IT en r...

In [12]:
data_2 = data_2.drop(columns=['Unnamed: 0','datePremierePublication', 'LANGUE', 'SAVOIR_ETRE','SAVOIR_FAIRE', 'salaireTexte', 'entreprise', 'enseigne', 'description', 'profil','entreprise_description'])
data_2 = data_2.rename(columns={
    'adresseOffre': 'company_location',
    'intitule': 'job_title'
})
# Remove the time component from the 'date' column
data_2['datePublication'] = data_2['datePublication'].str.split('T').str[0]
data_2.head()

    company_location               job_title datePublication
0  NEUILLY SUR SEINE  Développeur Python F/H      2023-11-23
1           PARIS 18  Développeur Python F/H      2023-11-23
2           PARIS 18  Développeur Python F/H      2023-11-23
3           GRENOBLE  Développeur Python F/H      2023-11-22
4    AIX EN PROVENCE  Developpeur Python F/H      2023-11-22

In [8]:
data.shape

(403, 14)

In [6]:
# Load the CSV data
data_4 = pd.read_csv(r"C:\Users\User\Desktop\Project\2-Cleaning_Data\data\data_science_canada_march_2024.csv")
data_4.head()

,applicationsCount,companyId,companyName,companyUrl,contractType,description,experienceLevel,jobUrl,location,postedTime,posterFullName,posterProfileUrl,publishedAt,salary,sector,title,workType
0,Over 200 applicants,3205573.0,DoorDash,https://www.linkedin.com/company/doordash?trk=...,Internship,About the Team\n\nThe International Analytics ...,Entry level,https://ca.linkedin.com/jobs/view/data-science...,"Toronto, Ontario, Canada",1 month ago,NaN,NaN,2024-02-14,NaN,"Technology, Information and Internet","Data Science, Analytics, International",Engineering and Information Technology
1,Over 200 applicants,101205064.0,Why Hiring,https://www.linkedin.com/company/whyhiring?trk...,Full-time,"At Why Hiring, we believe in the power of conn...",Entry level,https://ca.linkedin.com/jobs/view/junior-data-...,Canada,1 day ago,NaN,NaN,2024-03-20,NaN,Staffing and Recruiting,Junior Data Scientist,Engineering and Information Technology
2,Over 200 applicants,12446.0,Circle K,https://ca.linkedin.com/company/circle-k?trk=p...,Full-time,Responsibilities/Accountabilities\n\n\n * Deve...,Entry level,https://ca.linkedin.com/jobs/view/associate-da...,"Toronto, Ontario, Canada",1 month ago,Kelsea Lookedoo,https://www.linkedin.com/in/kelsea-lookedoo-78...,2024-02-21,NaN,Retail,Associate Data Scientist,Engineering and Information Technology
3,62 applicants,2648012.0,TV2 Consulting,https://www.linkedin.com/company/tv2-consultin...,Contract,* python and geospatial analytics experience ...,Entry level,https://ca.linkedin.com/jobs/view/data-scienti...,"Toronto, Ontario, Canada",1 month ago,NaN,NaN,2024-02-08,NaN,"Technology, Information and Internet",Data Scientist,Engineering and Information Technology
4,Over 200 applicants,86813252.0,LTIMindtree,https://in.linkedin.com/company/ltimindtree?tr...,Full-time,About Us:\n\nLTIMindtree is a global technolog...,Mid-Senior level,https://ca.linkedin.com/jobs/view/data-scienti...,"Markham, Ontario, Canada",3 weeks ago,Reshma Shameer,https://in.linkedin.com/in/reshma-shameer-3783...,2024-02-29,"$120,000.00-$150,000.00",IT Services and IT Consulting,Data Scientist,Information Technology

In [13]:
# Select the columns to keep and rename them
data_3 = data_3[['location', 'publishedAt', 'title']].rename(columns={
    'location': 'company_location',
    'publishedAt': 'datePublication',
    'title': 'job_title'
})

In [14]:
data_3.head()

,company_location,datePublication,job_title
0,"Toronto, Ontario, Canada",2024-02-14,"Data Science, Analytics, International"
1,Canada,2024-03-20,Junior Data Scientist
2,"Toronto, Ontario, Canada",2024-02-21,Associate Data Scientist
3,"Toronto, Ontario, Canada",2024-02-08,Data Scientist
4,"Markham, Ontario, Canada",2024-02-29,Data Scientist

In [21]:
data_3.shape

(340, 17)

In [7]:
# Load the CSV data
data_4 = pd.read_csv(r"C:\Users\User\Desktop\Project\2-Cleaning_Data\data\linkedin_canada.csv")
data_4.head()

,applicationsCount,companyId,companyName,contractType,description,experienceLevel,location,postedTime,publishedAt,salary,sector,title,workType
0,Over 200 applicants,11000395.0,Embarq,Full-time,About Embarq\n\nWe help VC-backed US startups ...,Mid-Senior level,"Quebec, Canada",2 weeks ago,2024-01-05,NaN,IT Services and IT Consulting and Software Dev...,Machine Learning Engineer,Engineering and Information Technology
1,Over 200 applicants,912833.0,Thumbtack,Full-time,A home is the biggest investment most people m...,Not Applicable,"Ontario, Canada",2 weeks ago,2024-01-05,NaN,"Technology, Information and Internet","Data Scientist, Business Analytics",Engineering and Information Technology
2,Over 200 applicants,10064814.0,Clarifai,Full-time,"About The Company\n\nClarifai is a leading, fu...",Mid-Senior level,"Montreal, Quebec, Canada",4 months ago,2023-09-15,NaN,"Technology, Information and Internet",Data Scientist,Engineering and Information Technology
3,Over 200 applicants,6637598.0,Drop,Full-time,"As a member of the Data Science team, you are ...",Not Applicable,"Toronto, Ontario, Canada",2 months ago,2023-11-15,NaN,"Transportation, Logistics, Supply Chain and St...","Data Science, Investment Research",Engineering and Information Technology
4,Over 200 applicants,2681218.0,Logikk,Full-time,Data Scientist - Computer Vision Tech Company ...,Mid-Senior level,"Montreal, Quebec, Canada",2 weeks ago,2024-01-05,NaN,IT Services and IT Consulting,Data Scientist,Engineering

In [15]:
data_4 = data_4[['location', 'publishedAt', 'title']].rename(columns={
    'location': 'company_location',
    'publishedAt': 'datePublication',
    'title': 'job_title'
})

In [16]:
data_4.head()

,company_location,datePublication,job_title
0,"Quebec, Canada",2024-01-05,Machine Learning Engineer
1,"Ontario, Canada",2024-01-05,"Data Scientist, Business Analytics"
2,"Montreal, Quebec, Canada",2023-09-15,Data Scientist
3,"Toronto, Ontario, Canada",2023-11-15,"Data Science, Investment Research"
4,"Montreal, Quebec, Canada",2024-01-05,Data Scientist

In [18]:
data_4.shape

(275, 13)

In [8]:
# Load the CSV data
data_5 = pd.read_csv(r"C:\Users\User\Desktop\Project\2-Cleaning_Data\data\linkedin-jobs-africa.csv")
data_5.head()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Data Analyst,NNC,We are looking for a passionate certified Data...,onsite,NaN,"Cairo, Cairo, Egypt","[{'مستوى الأقدمية': 'غير مطبق'}, {'نوع التوظيف...",2022-11-18,https://eg.linkedin.com/jobs/view/data-analyst...
1,Data Analyst,Watu Credit,"WATU is a focus-driven, customer-centric compa...",onsite,NaN,"Nairobi County, Kenya","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-01,https://ke.linkedin.com/jobs/view/data-analyst...
2,Data Analyst (Credit Risk),Kuda,Kuda is a fintech on a mission to make financi...,onsite,NaN,"Cape Town, Western Cape, South Africa","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-21,https://za.linkedin.com/jobs/view/data-analyst...
3,Data Analyst,Watu Credit,Role: Data AnalystReporting to: Data Analytics...,onsite,NaN,"Nairobi, Nairobi County, Kenya","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-01,https://ke.linkedin.com/jobs/view/data-analyst...
4,Data Analyst,Tata Consultancy Services,About Tata Consultancy ServicesTata Consultanc...,onsite,NaN,"City of Johannesburg, Gauteng, South Africa","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-27,https://za.linkedin.com/jobs/view/data-analyst...

In [17]:
data_5 = data_5[['title', 'location', 'posted_date']].rename(columns={
    'location': 'company_location',
    'posted_date': 'datePublication',
    'title': 'job_title'
})
data_5.head()

,job_title,company_location,datePublication
0,Data Analyst,"Cairo, Cairo, Egypt",2022-11-18
1,Data Analyst,"Nairobi County, Kenya",2022-11-01
2,Data Analyst (Credit Risk),"Cape Town, Western Cape, South Africa",2022-11-21
3,Data Analyst,"Nairobi, Nairobi County, Kenya",2022-11-01
4,Data Analyst,"City of Johannesburg, Gauteng, South Africa",2022-10-27

In [33]:
data_5.shape

(2872, 9)

In [9]:
# Load the CSV data
data_6 = pd.read_csv(r"C:\Users\User\Desktop\Project\2-Cleaning_Data\data\linkedin-jobs-usa.csv")
data_6.head()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Buffalo-Niagara Falls Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"San Jose, CA","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Texas, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Illinois, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Entry-Level Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,NaN,"Chicago, IL","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...

In [18]:
data_6 = data_6[['title', 'location', 'posted_date']].rename(columns={
    'location': 'company_location',
    'posted_date': 'datePublication',
    'title': 'job_title'
})
data_6.head()

,job_title,company_location,datePublication
0,Data Analyst,"Cairo, Cairo, Egypt",2022-11-18
1,Data Analyst,"Nairobi County, Kenya",2022-11-01
2,Data Analyst (Credit Risk),"Cape Town, Western Cape, South Africa",2022-11-21
3,Data Analyst,"Nairobi, Nairobi County, Kenya",2022-11-01
4,Data Analyst,"City of Johannesburg, Gauteng, South Africa",2022-10-27

In [38]:
data_6.shape

(2872, 9)